# PANDAS Series

In [3]:
#To create a numeric series
numbers = range(1,100,5)
pd.Series(numbers)

0      1
1      6
2     11
3     16
4     21
5     26
6     31
7     36
8     41
9     46
10    51
11    56
12    61
13    66
14    71
15    76
16    81
17    86
18    91
19    96
dtype: int64

In [5]:
#To create an object series
string = "Hi" , "How" ,"are", "you", "?"
pd.Series(string)

0     Hi
1    How
2    are
3    you
4      ?
dtype: object

In [7]:
#To create a series by giving both numeric and string values
s = pd.Series([345, 'London', 34.5, -34.45, 'Happy Birthday'])
s

0               345
1            London
2              34.5
3            -34.45
4    Happy Birthday
dtype: object

In [9]:
#To set index values for a series
marks = [60, 89, 74, 86]

subject = ["Maths", "Science", "English" , "Social Science"]

pd.Series(marks, index = subject)

Maths             60
Science           89
English           74
Social Science    86
dtype: int64

In [11]:
#To create a series from a dictionary*
data = {'Maths': 60, 'Science': 89, 'English': 76, 'Social Science': 86}

pd.Series(data)

Maths             60
Science           89
English           76
Social Science    86
dtype: int64

In [13]:
#A series with missing values
subjects = ["Maths", "Science", "Art and Craft" , "Social Science"]

marks_series = pd.Series(data, index = subjects)

print(marks_series)

Maths             60.0
Science           89.0
Art and Craft      NaN
Social Science    86.0
dtype: float64

# Manipulating Series

In [14]:
#To check for null values using `.isnull`**
marks_series.isnull()

Maths             False
Science           False
Art and Craft      True
Social Science    False
dtype: bool

In [16]:
#To check for null values using `.notnull`**
marks_series.notnull()

Maths              True
Science            True
Art and Craft     False
Social Science     True
dtype: bool

In [17]:
#to know the subjects in which marks score is more than 75*
marks_series[marks_series > 75]

Science           89.0
Social Science    86.0
dtype: float64

In [18]:
#To assign 68 marks to 'Art and Craft'**
marks_series["Art and Craft"] = 68

In [20]:
# To check whether Maths marks are 73**
marks_series.Maths == 73
marks_series["Maths"] == 73

False

In [22]:
#Sorting a numeric series
import numpy as np
values = pd.Series([23, 45, np.nan, 41, 23, 34, 55, np.nan, 34, 20])
#values
values.sort_values(ascending = True)#asscending
values.sort_values(ascending = False)

6    55.0
1    45.0
3    41.0
5    34.0
8    34.0
0    23.0
4    23.0
9    20.0
2     NaN
7     NaN
dtype: float64

In [23]:
#Rank a Series*
marks_series.rank( ascending=True, pct=False)

Maths             1.0
Science           4.0
Art and Craft     2.0
Social Science    3.0
dtype: float64

# Common Series Methods

In [38]:
#To Get the statistical summary of the series.
series1 = pd.Series([2,4,6,8,10,12])
series1.describe()

count     6.000000
mean      7.000000
std       3.741657
min       2.000000
25%       4.500000
50%       7.000000
75%       9.500000
max      12.000000
dtype: float64

In [60]:
marks_series.describe()#for catagorical

count     4.000000
mean     75.750000
std      14.008926
min      60.000000
25%      66.000000
50%      77.000000
75%      86.750000
max      89.000000
dtype: float64

In [25]:
# apply method
# lambda is one linear function
print('Original Series:','\n', series1)
series1.apply(lambda x: x**2)

Original Series:
 0     2
1     4
2     6
3     8
4    10
5    12
dtype: int64

0      4
1     16
2     36
3     64
4    100
5    144
dtype: int64

In [26]:
# count() method
series2 = pd.Series([2,4,6,8,10,12,np.nan])
series2.count() # nan is not counted

6

In [27]:
# isna() method
series2.isna()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
#isnull()method
series2.isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
# copy() method
series2_copy = series2.copy()
series2_copy

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5    12.0
6     NaN
dtype: float64

In [31]:
# fillna() method
series2_copy.fillna(2)

0     2.0
1     4.0
2     6.0
3     8.0
4    10.0
5    12.0
6     2.0
dtype: float64

In [35]:
## drop() method
series_1 = pd.Series(data=np.arange(6), index=['A', 'B', 'C','D','E','F'])
#series_1
#To remove a specific row or column by mentioning the index value and/or the axis (0,1)
series_1.drop(labels='E')

A    0
B    1
C    2
D    3
F    5
dtype: int32

In [36]:
# rename() - Used to rename the indexes or the columns in a dataset
series_1.rename({'A': 'Y'})

Y    0
B    1
C    2
D    3
E    4
F    5
dtype: int32

# Practise

In [49]:
#Create an empty series
import numpy as np
pd.Series()

Series([], dtype: object)

In [51]:
#Creating series from an array ([20, 30])
arr_1=np.array([20,30])
pd.Series(arr_1)

0    20
1    30
dtype: int32

In [53]:
#Creating series from  list
list = ['p', 'y', 't', 'h', 'o', 'n']
pd.Series(list)

0    p
1    y
2    t
3    h
4    o
5    n
dtype: object

In [55]:
#Creating series from dictionary
dictionary = {0: 21, 1: 400, 2: 39, 3: 10}
pd.Series(dictionary)

0     21
1    400
2     39
3     10
dtype: int64

In [57]:
dictionary1 = {'w': 21, 'x': 400, 'y': 39, 'z': 10}
pd.Series(dictionary1)

w     21
x    400
y     39
z     10
dtype: int64

In [61]:
#Show the statistical vlaues for the series using describe() function
series = pd.Series([2,4,6,8,10,12])
series.describe()

count     6.000000
mean      7.000000
std       3.741657
min       2.000000
25%       4.500000
50%       7.000000
75%       9.500000
max      12.000000
dtype: float64

In [63]:
# Show the count for the given series using count() function
series = pd.Series([2,4,6,8,10,12,np.nan])
series.count()

6

In [72]:
#Append the given series using append() function
series1 = pd.Series([10, 20])
series2 = pd.Series([40, 60], index=[2, 3])
series3=pd.concat([series1,series2])#append not working in latest version
print(series3)

0    10
1    20
2    40
3    60
dtype: int64

In [95]:
#Square the given series(series1 & series2) using apply() function
 # lambda is one liner function
 #square the values in series1 & series2 using lambda and print the new values
#print(series1)
print(series1.apply(lambda x:x**2))
print(series2.apply(lambda x:x**2))

0    100
1    400
dtype: int64
2    1600
3    3600
dtype: int64

In [96]:
# Using copy() function to copy series1 & series2
series1_copy=series1.copy()
series2_copy=series2.copy()
print(series1_copy)
print(series2_copy)

0    10
1    20
dtype: int64
2    40
3    60
dtype: int64

In [97]:
series = pd.Series(data= [2000.56, 1234.00, 2133.67, 7890.80, 2234.10], name = "Salary")
series

0    2000.56
1    1234.00
2    2133.67
3    7890.80
4    2234.10
Name: Salary, dtype: float64

In [100]:
#Using add(), add the series [2,4,6,8,10] to the above series with name "Salary"
s2=pd.Series([2,4,6,8,10])
series.add(s2)

0    2002.56
1    1238.00
2    2139.67
3    7898.80
4    2244.10
dtype: float64

In [103]:
s3=pd.Series([2,4,6,8,10])
series.sub(s3)

0    1998.56
1    1230.00
2    2127.67
3    7882.80
4    2224.10
dtype: float64

In [105]:
s4=pd.Series([2,4,6,8,10])
series.mul(s4)

0     4001.12
1     4936.00
2    12802.02
3    63126.40
4    22341.00
dtype: float64

In [107]:
series.div(s4)

0    1000.280000
1     308.500000
2     355.611667
3     986.350000
4     223.410000
dtype: float64

In [109]:
series.sum()

15493.13

In [111]:
series.mean()

3098.6259999999997

In [116]:
print(series.sort_values())
series.sort_values(ascending=False)

1    1234.00
0    2000.56
2    2133.67
4    2234.10
3    7890.80
Name: Salary, dtype: float64

3    7890.80
4    2234.10
2    2133.67
0    2000.56
1    1234.00
Name: Salary, dtype: float64

# Pandas DataFrames

# Creating DataFrames

In [117]:
#iCreating a data frame a dctionar
data = {'Subject': ['Maths', 'History', 'Science', 'English', 'Georaphy', 'Art'],
        'Marks': (45, 65, 78, 65, 80, 78),
        'CGPA': [2.5, 3.0, 3.5, 2.0, 4.0, 4.0]}

df = pd.DataFrame(data)
print(df)

    Subject  Marks  CGPA
0     Maths     45   2.5
1   History     65   3.0
2   Science     78   3.5
3   English     65   2.0
4  Georaphy     80   4.0
5       Art     78   4.0

In [118]:
#To create dataframe from series**
Subject = pd.Series(['Maths', 'History', 'Science', 'English', 'Georaphy', 'Art'])
Marks = pd.Series([45, 65, 78, 65, 80, 78])
CGPA = pd.Series([2.5, 3.0, 3.5, 2.0, 4.0, 4.0])
pd.DataFrame([Subject,Marks,CGPA], index = ['Subject','Marks','CGPA'])

             0        1        2        3         4    5
Subject  Maths  History  Science  English  Georaphy  Art
Marks       45       65       78       65        80   78
CGPA       2.5      3.0      3.5      2.0       4.0  4.0

In [119]:
#to want a vertical dataframe so we use `.T`. The 'T' stands for transpose.
pd.DataFrame([Subject,Marks,CGPA], index = ['Subject','Marks','CGPA']).T

    Subject Marks CGPA
0     Maths    45  2.5
1   History    65  3.0
2   Science    78  3.5
3   English    65  2.0
4  Georaphy    80  4.0
5       Art    78  4.0

In [120]:
#To create dataframe from lists**
Subject = ['Maths', 'History', 'Science', 'English', 'Georaphy', 'Art']
Marks = [45, 65, 78, 65, 80, 78]
CGPA = [2.5, 3.0, 3.5, 2.0, 4.0, 4.0]
pd.DataFrame([Subject,Marks,CGPA], index = ['Subject','Marks','CGPA']).T

    Subject Marks CGPA
0     Maths    45  2.5
1   History    65  3.0
2   Science    78  3.5
3   English    65  2.0
4  Georaphy    80  4.0
5       Art    78  4.0

# Practise

In [143]:
#Create a dataframe(df) from the given dictionary
dictionary = {'col1': [10.0, 20.0], 'col2': [30.0, np.nan]}
dictionary
data1=pd.DataFrame(dictionary)
data1

   col1  col2
0  10.0  30.0
1  20.0   NaN

In [144]:
#Creating dataframe(df) from a nd array [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
arr=[[1, 2, 3], [4, 5, 6], [7, 8, 9]]
data2=pd.DataFrame(arr)
(data2)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [149]:
#Creating dataframe(df) from a list of dictionaries [{"col1": 10, "col2": 20}, {"col1": 50, "col2": 100, "col3": 200}]
dict_1=[{"col1": 10, "col2": 20}, {"col1": 50, "col2": 100, "col3": 200}]
data3=pd.DataFrame(dict_1)
data3

   col1  col2   col3
0    10    20    NaN
1    50   100  200.0

In [162]:
#Creating dataframe(df) from a dictionary of lists, list1 = [10.0, 20.0, 30.0, 40.0], list2 = [40.0, 30.0, 20.0, 10.0]
list1 = [10.0, 20.0, 30.0, 40.0]
list2 = [40.0, 30.0, 20.0, 10.0]
dict1=dict(zip(list1,list2))
print(dict1)
data4=pd.DataFrame([dict1])
data4
#

{10.0: 40.0, 20.0: 30.0, 30.0: 20.0, 40.0: 10.0}

   10.0  20.0  30.0  40.0
0  40.0  30.0  20.0  10.0

In [164]:
#Perform indexing based on the given index from the datafreme.
df3 = pd.DataFrame([[100, 2500], [490, 789], [500, 1500]],
     index=['pune', 'mumbai', 'nagpur'],
     columns=['max_speed(kmph)', 'distance(km)'])
df3

        max_speed(kmph)  distance(km)
pune                100          2500
mumbai              490           789
nagpur              500          1500

In [62]:
df3.loc[0]

KeyError: 0

In [186]:
df4.iloc[0]

max_speed(kmph)     100
distance(km)       2500
Name: pune, dtype: int64

In [16]:
#describe() function for the above dataframe
dict = {'name':["John", "Puneet", "Sudhir", "Geeta"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)

df.describe()
df.describe(include='object') #include catagorical

        name degree
count      4      4
unique     4      3
top     John    MBA
freq       1      2

In [193]:
#Show the counts for the above dataframe using count() function
df.count()

name      4
degree    4
score     4
dtype: int64

In [17]:
#Use the append() function for the below dataframes
import pandas as pd
df2 = pd.DataFrame([[1, 2], [3, 4]],columns=list('AB'),index=['x', 'y'])
pd.concat([df2,df3])

   A  B
x  1  2
y  3  4
x  5  6
y  7  8

In [19]:
df3 = pd.DataFrame([[5, 6], [7, 8]], columns=list('AB'), index=['x', 'y'])
df3
pd.concat([df2,df3])

   A  B
x  1  2
y  3  4
x  5  6
y  7  8

In [21]:
df.columns

Index(['name', 'degree', 'score'], dtype='object')

In [23]:
df.dtypes

name      object
degree    object
score      int64
dtype: object

In [26]:
df.score=df.score.astype(float)
df

     name  degree  score
0    John     MBA   90.0
1  Puneet     BCA   40.0
2  Sudhir  M.Tech   80.0
3   Geeta     MBA   98.0

In [28]:
df2_copy=df2.copy()

In [30]:
df.head()

     name  degree  score
0    John     MBA   90.0
1  Puneet     BCA   40.0
2  Sudhir  M.Tech   80.0
3   Geeta     MBA   98.0

In [32]:
df.tail()

     name  degree  score
0    John     MBA   90.0
1  Puneet     BCA   40.0
2  Sudhir  M.Tech   80.0
3   Geeta     MBA   98.0

In [34]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   degree  4 non-null      object
 2   score   4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 228.0+ bytes

In [37]:
# Find the rank for the dataframe df using methodss 'min' and 'dense'. Sort it in both ascending and decending order and display it
df['score_rank']=df['score'].rank(method='dense')
df

     name  degree  score  score_rank
0    John     MBA   90.0         3.0
1  Puneet     BCA   40.0         1.0
2  Sudhir  M.Tech   80.0         2.0
3   Geeta     MBA   98.0         4.0

In [39]:
df['score_rank']=df['score'].rank(method='min')
df

     name  degree  score  score_rank
0    John     MBA   90.0         3.0
1  Puneet     BCA   40.0         1.0
2  Sudhir  M.Tech   80.0         2.0
3   Geeta     MBA   98.0         4.0

In [41]:
df.isnull().sum()

name          0
degree        0
score         0
score_rank    0
dtype: int64

In [45]:
rows,columns=df.shape
print(rows)# or len(df)

4

In [46]:
missing_data.isnull().sum()

NameError: name 'missing_data' is not defined

In [48]:
dict = {'name':["John", "Puneet", "Sudhir", "Geeta"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
df = pd.DataFrame(dict)
df

     name  degree  score
0    John     MBA     90
1  Puneet     BCA     40
2  Sudhir  M.Tech     80
3   Geeta     MBA     98

In [51]:
for index,row in df.iterrows():
    print(index)
    print(row)

0
name      John
degree     MBA
score       90
Name: 0, dtype: object
1
name      Puneet
degree       BCA
score         40
Name: 1, dtype: object
2
name      Sudhir
degree    M.Tech
score         80
Name: 2, dtype: object
3
name      Geeta
degree      MBA
score        98
Name: 3, dtype: object

In [61]:
for index,column in df.itertuples():
    print(index)
    print(column)

ValueError: too many values to unpack (expected 2)

In [59]:
for index,column in df.items():
    print(index)
    print(column)

name
0      John
1    Puneet
2    Sudhir
3     Geeta
Name: name, dtype: object
degree
0       MBA
1       BCA
2    M.Tech
3       MBA
Name: degree, dtype: object
score
0    90
1    40
2    80
3    98
Name: score, dtype: int64